#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.redirect_lambda.data.archive_file.lambda: Reading...
module.create_short_url_lambda.data.archive_file.lambda: Reading...
module.redirect_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.create_short_url_lambda.data.archive_file.lambda: Read complete after 0s [id=33cd2b3d2308c928d474dc204dc655e53db5f0e1]
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Reading...
module.create_short_url_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]
module.redirect_lambda.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=2690255455]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.allow_get_url_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_get_url_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dax:Query",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # data.aws_iam_policy_document.create_short_url_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "create_short_url_lambda" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:PutItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
    }

  # aws_api_gateway_resource.redirect_resource will be created
  + resource "aws_api_gateway_resource" "redirect_resource" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{redirectCode}"
      + rest_api_id = (known after apply)
    }

  # aws_api_gateway_rest_api.url_shortener_api will be created
  + resource "aws_api_gateway_rest_api" "url_shortener_api" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = (known after apply)
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "slim-url-shortener-api"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)
    }

  # aws_dynamodb_table.urls will be created
  + resource "aws_dynamodb_table" "urls" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "ID"
      + id               = (known after apply)
      + name             = "urls"
      + range_key        = "Code"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "Code"
          + type = "S"
        }
      + attribute {
          + name = "ID"
          + type = "S"
        }
      + attribute {
          + name = "URL"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "Code"
          + name               = "CodeIndex"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "URL"
          + read_capacity      = 1
          + write_capacity     = 1
        }
    }

  # module.create_short_url_lambda.data.aws_iam_policy_document.policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policies" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = [
          + (known after apply),
        ]

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "LogToCloudwatch"
        }
    }

  # module.post_url_method.aws_api_gateway_method.method will be created
  + resource "aws_api_gateway_method" "method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.redirect_lambda.data.aws_iam_policy_document.policies will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "policies" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + minified_json             = (known after apply)
      + override_policy_documents = [
          + (known after apply),
        ]

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*:*:*",
            ]
          + sid       = "LogToCloudwatch"
        }
    }

  # module.redirect_lambda.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "redirect-7ab45cd4239b38170e421f5a93591211cb058ac7-lambda-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "DefaultPolicy"
          + policy = (known after apply)
        }
    }

  # module.redirect_lambda.aws_lambda_function.lambda will be created
  + resource "aws_lambda_function" "lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "redirect-7ab45cd4239b38170e421f5a93591211cb058ac7_lambda_function_payload.zip"
      + function_name                  = "redirect-7ab45cd4239b38170e421f5a93591211cb058ac7"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs20.x"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)
    }

  # module.redirect_url_method.aws_api_gateway_integration.integration will be created
  + resource "aws_api_gateway_integration" "integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.redirect_url_method.aws_api_gateway_method.method will be created
  + resource "aws_api_gateway_method" "method" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.redirect_url_method.aws_lambda_permission.apigw_lambda will be created
  + resource "aws_lambda_permission" "apigw_lambda" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "redirect-7ab45cd4239b38170e421f5a93591211cb058ac7"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

```

</details>
*Pushed by: @EsmerlinJM, Action: `pull_request`*